# PaperSourceSet Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
PaperSourceSet Constructor
PaperSourceSet Class See Also
---
Initializes a new instance of the PaperSourceSet class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PaperSourceSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
PaperSourceSet()
```

# See Also
PaperSourceSet Class
Autodesk.Revit.DB Namespace